"use strict"

console.log('number' + 3 + 3); // number33 - тут використовується правило конкатенації строка + число = строка, спочатку 'number + 3 = number3', а потім 'number3 + 3 = number33'

console.log(null + 3); // 3 - null у нас приводиться до числа 0, отже 0 + 3 = 3

console.log(5 && "qwerty") // qwerty - оператор && повертає останнє truthy значення, якщо обидва truthy. 5 – це truthy, "qwerty" – також, тому результат: "qwerty"

console.log(+'40' + +'2' + "hillel"); // 42hillel - так як +'40' и +'2' це унарні плюси ми отримуємо число 42, а далі число + строка = конкатенація

console.log('10' - 5 === 6); /* false - спочатку у нас строка '10' за допомогою арифметичного оператора перетворюється в число і виконується 10-5=5, 
по строгій рівності 5 не дорівнює 6, а це false */

console.log(true + false); // 1 - тут у нас true = 1 і false = 0 ітого 1 + 0 = 1

console.log('4px' - 3); // NaN - так як у нас в стрінзі не тільки число, але і букви ми не можемо перетворити в число і провести арифметичну операцію

console.log('4' - 3); // 1 - А вот тут у нас вже типове перетворення стрінги в число і арифметичний оператор, тут вийде 1

console.log('6' + 3 ** 0); // 61 - спочатку 3 зводим в ступінь 0 = 1, потім конкатенація '6' + 1 = 61

console.log(12 / '6'); // 2 - перетворення строки в число і виконання арифметичного оператора

console.log('10' + (5 === 6)); // 10false - спочатку виконується дія в дужках, там у нас строге порівняння і ми отримуємо false, а далі конкатенація 10 + false

console.log(null == ''); // false - тому що в оператору рівності null не приводиться до числу, true тільки якщо null == null або null == undefined

console.log(3 ** (9 / 3)); // 27 - звичайні арифметичні оператори, спочатку дужки (у них вище пріоритет), а потім зведення в ступінь

console.log(!!'false' == !!'true'); // true - тому що оператор рівності порівнює два бульовихз значення не пустих стрінг, у обох там буде true, !! - у нас це унарне приведення до типу Boolean

console.log(0 || '0' && 1); /* 1 - при && у нас повертається останнє true, при || ми отримуємо перше значення false і дивимось далі, 
а потім true, це тру ми і отримуємо в результаті */

console.log((+null == false) < 1); /* false - +null унарний плюс тому отримуємо 0, оператор порівняння у нас призводить false до числа 0 і ми порівнюємо 0 = 0 - це true.
 Потім при порівнянні ми перетворюємо true на 1 і отримуємо 1 < 1 = false */  

console.log(false && true || true); // true - спочатку виконується && і повертає нам перший false, після чого виконується || і повертає нам перший true

console.log(false && (false || true)); // false - тому що спочатку виконується дія в дужках, а там || повертає нам перше true, а потім виконується && і повертає нам перший false

console.log((+null == false) < 1 ** 5); /* false - спочатку у нас унарний +null = 0, потім оператор порівняння 0 == false (який при порівнянні стає 0) і це true, 
потім у нас 1 ** 5 = 1, і на останок порівняння true (яке є 1) < 1 = і це у нас буде false */